package results

import (
	"testing"

	. "github.com/smartystreets/goconvey/convey"
)

func TestParseRecords(t *testing.T) {
	records := [][]string{
		{
			"Сазонов",
			"Даниил",
			"18У667",
			"ИУ6-43Б",
			"Бакалавриат",
			"ИУ6",
			"sazonovdd@student.bmstu.ru",
			"sdd18u667",
			"Завершено",
			"18 марта 2022  16:12",
			"18 марта 2022  16:13",
			"18 сек.",
			"Еще не оценено",
			"Верно?",
			"Неверно",
			"Неверно",
			"Дайте определение БД и СУБД",
			"фффф",
			"Таблицы и связи между ними",
			"Вручную",
			"фффф",
			"-",
		},
		{
			"Логачёв",
			"Кирилл",
			"18У354",
			"ИУ6-43Б",
			"Бакалавриат",
			"ИУ6",
			"logachevka@student.bmstu.ru",
			"lka18u354",
			"Завершено",
			"18 марта 2022  16:15",
			"18 марта 2022  16:15",
			"25 сек.",
			"Еще не оценено",
			"Верно?",
			"Неверно",
			"Неверно",
			"Дайте определение БД и СУБД",
			"ыфвф",
			"Таблицы и связи между ними",
			"Вручную",
			"фыфвффывф",
			"-",
		},
	}

	results := []Result{
		{
			Information{
				"Сазонов",
				"Даниил",
				"18У667",
				"ИУ6-43Б",
				"Бакалавриат",
				"ИУ6",
				"sazonovdd@student.bmstu.ru",
				"sdd18u667",
				"Завершено",
				"18 марта 2022  16:12",
				"18 марта 2022  16:13",
				"18 сек.",
				"Еще не оценено",
			},
			[]Question{
				{
					"Верно?",
					"Неверно",
					"Неверно",
				},
				{
					"Дайте определение БД и СУБД",
					"фффф",
					"Таблицы и связи между ними",
				},
				{
					"Вручную",
					"фффф",
					"-",
				},
			},
		},
		{
			Information{
				"Логачёв",
				"Кирилл",
				"18У354",
				"ИУ6-43Б",
				"Бакалавриат",
				"ИУ6",
				"logachevka@student.bmstu.ru",
				"lka18u354",
				"Завершено",
				"18 марта 2022  16:15",
				"18 марта 2022  16:15",
				"25 сек.",
				"Еще не оценено",
			},
			[]Question{
				{
					"Верно?",
					"Неверно",
					"Неверно",
				},
				{
					"Дайте определение БД и СУБД",
					"ыфвф",
					"Таблицы и связи между ними",
				},
				{
					"Вручную",
					"фыфвффывф",
					"-",
				},
			},
		},
	}

	Convey("ParseRecords should parse records into []Result structure", t, func() {
		So(ParseRecords(records), ShouldResemble, results)
	})
}
